//
// Created by Роман Князев on 16.12.2022.
//

// Задание: Определить, лежат ли две точки с координатами (x1, y1) и (x2, y2) в одной четверти.

#include <iostream>

using namespace std;

int main() {

    setlocale(LC_CTYPE, "Russian");

    // Ввод x_1, y_1, x_2, y_2

    double x_1, y_1, x_2, y_2;

    cout << "Введите x_1 = ";
    cin >> x_1;

    cout << "Введите y_1 = ";
    cin >> y_1;

    cout << "Введите x_2 = ";
    cin >> x_2;

    cout << "Введите y_2 = ";
    cin >> y_2;

    if (x_1 == 0 && x_2 == 0) {
        if (y_1 == 0 && y_2 == 0) {
            cout << "Обе точки находятся в начале координат (0, 0).";
        } else {
            cout << "Обе точки находятся на оси y.";
        }
    } else {
        if (y_1 == 0 && y_2 == 0) {
            cout << "Обе точки находятся на оси x.";
        } else {
            if (x_1 * x_2 > 0 && y_1 * y_2 > 0) {
                cout << "Обе точки находятся в одной четверти";
            } else {
                cout << "Обе точки не находятся в одной четверти.";
            }
        }
    }
}
